app/controllers/api/layouts_controller.rb

SELECT "layouts"."name", "layouts"."body" FROM "layouts"
---
  def index
    @name_body = Layout.pluck(:name, :body)