app/controllers/api/sites_controller.rb

SELECT "sites".* FROM "sites"
---
  def index
    if params[:tag]
      sites = Site.tagged_with(params[:tag])
    else
      sites = Site.all

INSERT INTO "sites" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test_site"], ["user_id", 4], ["created_at", 2016-10-02 18:52:42 UTC], ["updated_at", 2016-10-02 18:52:42 UTC]]
---
  def create
    site = Site.create(site_params.merge(user_id: current_user.id))

DELETE FROM "sites" WHERE "sites"."id" = $1  [["id", 7]]
---
  def destroy
    @site.destroy

SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def find_site
    @site = Site.find(params[:id])