app/controllers/api/tags_controller.rb

SELECT "tags"."name" FROM "tags"
---
  def index
    @names = Tag.pluck :name