app/controllers/sites_controller.rb

  def show
    @site = Site.find(params[:id])
---
SELECT  "sites".* FROM "sites" WHERE "sites"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]