app/controllers/tags_controller.rb

  def index
    @names = Tag.pluck :name
---
SELECT "tags"."name" FROM "tags"